JWXL19733/WeGui_RGB/CW32L012/Lcd_Port/cw32l012_lcd_hard_4spi_port.c
#include "lcd_driver_config.h"
#include "lcd_wegui_config.h"

#if(LCD_PORT == _HARD_4SPI)

#include "cw32l012_lcd_hard_4spi_port.h"
#include "lcd_driver.h"
#include "stdint.h"

//---库函数版本---
//等待SPI发送缓冲器为空
//#define wait_lcd_spi_txtemp_free() do{while(SPI_GetFlagStatus(CW_SPI1,SPI_FLAG_TXE)==RESET);}while(0)
//向SPI发送缓冲器发送一个数据
//#define send_lcd_spi_dat(dat)      do{SPI_SendData(CW_SPI1, dat);}while(0)
//等待SPI发送器空闲(发完)
//#define send_lcd_spi_done()        do{while(SPI_GetFlagStatus(CW_SPI1,SPI_FLAG_BUSY));}while(0)

//---寄存器版本---
//等待SPI发送缓冲器为空
#define wait_lcd_spi_txtemp_free() do{while((CW_SPI1->ISR & SPI_FLAG_TXE)==RESET);}while(0)
//向SPI发送缓冲器发送一个数据
#define send_lcd_spi_dat(dat)      do{SPI_SendData(CW_SPI1, dat);}while(0)
//等待SPI发送器空闲(发完)
#define send_lcd_spi_done()        do{while(CW_SPI1->ISR & SPI_FLAG_BUSY);}while(0)

/*
send_lcd_spi_dat(dat);//向SPI发送缓冲器发送一个数据
wait_lcd_spi_txtemp_free();//等待SPI发送缓冲器为空
send_lcd_spi_done();//等待SPI发送器空闲(发完)
*/
#if ((LCD_MODE == _FULL_BUFF_DYNA_UPDATE) || (LCD_MODE == _PAGE_BUFF_DYNA_UPDATE))
static uint16_t crc[((SCREEN_HIGH+7)/8)][PAGE_CRC_NUM];//储存crc
/*--------------------------------------------------------------
  * 名称: LCD_Reset_crc()
  * 功能: 刷新一次crc值(动态刷新专用)
  * 说明: 用于强制刷新屏幕,防止动态刷新出现区域不刷新
----------------------------------------------------------------*/
void LCD_Reset_crc()
{
	uint16_t i=0;
	uint16_t *p=&crc[0][0];
	while(i < ((SCREEN_HIGH+7)/8)*PAGE_CRC_NUM)
	{
		p[i]=0xff;//随机值,不是0x0就ok
		i++;
	}
}

//默认的动态刷新crc算法
#define lcd_crc() do \
{\
		CW_CRC->CR = CRC16_IBM;\
		uint8_t *i = &lcd_driver.LCD_GRAM[ypage][0][0];\
		for(x=0;x<(SCREEN_WIDTH*LCD_COLOUR_BIT);x++)\
		{\
			CW_CRC->DR = i[x];\
		}\
		i_crc = CW_CRC->RESULT;\
}while(0)
#endif

/*--------------------------------------------------------------
  * 名称: LCD_delay_ms(uint32_t ms)
  * 传入1: ms
  * 返回: 无
  * 功能: 软件延时
  * 说明: 非精准
----------------------------------------------------------------*/
void LCD_delay_ms(volatile uint32_t ms)
{
	//delay_ms(ms);
	
		volatile uint16_t i;
		while (ms--) 
		{
			i = 10000; //根据实际情况调整
			while (i--);
		}
}

/*--------------------------------------------------------------
  * 名称: LCD_Send_1Cmd(uint8_t dat)
  * 传入1: dat
  * 返回: 无
  * 功能: 向屏幕发送1个命令(DC=0时发1字节spi)
  * 说明: 
----------------------------------------------------------------*/
void LCD_Send_1Cmd(uint8_t dat)
{
	send_lcd_spi_done();//等待SPI发送器空闲(发完)
	LCD_DC_Clr();
	LCD_CS_Clr();
	{
		send_lcd_spi_dat(dat);//向SPI发送缓冲器发送一个数据
	}
	wait_lcd_spi_txtemp_free();//等待SPI发送缓冲器为空
	send_lcd_spi_done();//等待SPI发送器空闲(发完)
	LCD_CS_Set();
}
/*--------------------------------------------------------------
  * 名称: LCD_Send_1Dat(uint8_t dat)
  * 传入1: dat
  * 返回: 无
  * 功能: 向屏幕发送1个数据(DC=1时发1字节spi)
  * 说明: 
----------------------------------------------------------------*/
void LCD_Send_1Dat(uint8_t dat)
{
	send_lcd_spi_done();//等待SPI发送器空闲(发完)
	LCD_DC_Set();
	LCD_CS_Clr();
	{
		send_lcd_spi_dat(dat);//向SPI发送缓冲器发送一个数据
	}
	wait_lcd_spi_txtemp_free();//等待SPI发送缓冲器为空
	send_lcd_spi_done();//等待SPI发送器空闲(发完)
	LCD_CS_Set();
}

/*--------------------------------------------------------------
  * 名称: LCD_Send_nDat(uint8_t *p,uint16_t num)
  * 传入1: *p数组指针
  * 传入2: num发送数量
  * 返回: 无
  * 功能: 向屏幕发送num个数据
  * 说明: 
----------------------------------------------------------------*/
void LCD_Send_nDat(uint8_t *p,uint16_t num)
{
	uint16_t i=0;
	send_lcd_spi_done();//等待SPI发送器空闲(发完)
	LCD_DC_Set();
	LCD_CS_Clr();
	while(num>i)	  
	{
		wait_lcd_spi_txtemp_free();//等待SPI发送缓冲器为空
		send_lcd_spi_dat(p[i++]);//向SPI发送缓冲器发送一个数据
	}
	wait_lcd_spi_txtemp_free();//等待SPI发送缓冲器为空
	send_lcd_spi_done();//等待SPI发送器空闲(发完)
	LCD_CS_Set();
}



//-------------------------------------------OLED屏幕驱动接口----------------------------------------------
#if defined (LCD_USE_NORMAL_OLED) || defined (LCD_USE_GRAY_OLED)
/*--------------------------------------------------------------
  * 名称: LCD_Port_Init()
  * 传入: 无
  * 返回: 无
  * 功能: 屏幕接口初始化
  * 说明: 
----------------------------------------------------------------*/
void LCD_Port_Init(void)
{
	//TFT SPI SCL默认常低,第一个跳变数据沿有效
	SPI_InitTypeDef SPI_InitStructure;
  SPI_InitStructure.SPI_Direction = SPI_Direction_2Lines_FullDuplex;// 双线全双工
  SPI_InitStructure.SPI_Mode = SPI_Mode_Master;                     // 主机模式
  SPI_InitStructure.SPI_DataSize = SPI_DataSize_8b;                 // 帧数据长度为8bit
  SPI_InitStructure.SPI_CPOL = SPI_CPOL_High;                        // 时钟空闲电平为高
  SPI_InitStructure.SPI_CPHA = SPI_CPHA_2Edge;                      // 第2个边沿采样
  SPI_InitStructure.SPI_NSS = SPI_NSS_Soft;                         // 片选信号由SSI寄存器控制
  SPI_InitStructure.SPI_BaudRatePrescaler = SPI_BAUDRATE_PCLK_DIVx; // 波特率为PCLK的分频
  SPI_InitStructure.SPI_FirstBit = SPI_FirstBit_MSB;                // 最高有效位 MSB 收发在前
  SPI_InitStructure.SPI_Speed = SPI_Speed_Low;                      // 低速SPI
	
	LCD_SCL_IO_Init();
	LCD_SDA_IO_Init();
	LCD_RES_IO_Init();
	LCD_DC_IO_Init();
	LCD_CS_IO_Init();LCD_CS_Set();
	LCD_BL_IO_Init();LCD_BL_On();
	
	__SYSCTRL_SPI1_CLK_ENABLE();
	SPI_Init(CW_SPI1, &SPI_InitStructure);
  SPI_Cmd(CW_SPI1, ENABLE);
	
	#if ((LCD_MODE == _FULL_BUFF_DYNA_UPDATE) || (LCD_MODE ==_PAGE_BUFF_DYNA_UPDATE))
		__SYSCTRL_CRC_CLK_ENABLE();//动态刷新CRC校验用
	#endif
	
	LCD_RES_Clr();
	{
		volatile unsigned int i=10000;
		while(i--);
	}
	LCD_RES_Set();
}


/*--------------------------------------------------------------
  * 名称: LCD_Send_nCmd(uint8_t *p,uint16_t num)
  * 传入1: *p数组指针
  * 传入2: num发送数量
  * 返回: 无
  * 功能: 向屏幕发送num个命令
  * 说明: 
----------------------------------------------------------------*/
void LCD_Send_nCmd(uint8_t *p,uint16_t num)
{
	uint16_t i=0;
	send_lcd_spi_done();//等待SPI发送器空闲(发完)
	LCD_DC_Clr();
	LCD_CS_Clr();
	while(num>i)	  
	{
		wait_lcd_spi_txtemp_free();//等待SPI发送缓冲器为空
		send_lcd_spi_dat(p[i++]);//向SPI发送缓冲器发送一个数据
	}
	wait_lcd_spi_txtemp_free();//等待SPI发送缓冲器为空
	send_lcd_spi_done();//等待SPI发送器空闲(发完)
	LCD_CS_Set();
}







//-------------------------------------------RGB屏幕驱动接口----------------------------------------------
#elif defined (LCD_USE_RGB565)
void LCD_Port_Init(void)
{
	//TFT SPI SCL默认常低,第一个跳变数据沿有效
	SPI_InitTypeDef SPI_InitStructure;
  SPI_InitStructure.SPI_Direction = SPI_Direction_2Lines_FullDuplex;// 双线全双工
  SPI_InitStructure.SPI_Mode = SPI_Mode_Master;                     // 主机模式
  SPI_InitStructure.SPI_DataSize = SPI_DataSize_8b;                 // 帧数据长度为8bit
  SPI_InitStructure.SPI_CPOL = SPI_CPOL_Low;                        // 时钟空闲电平为低
  SPI_InitStructure.SPI_CPHA = SPI_CPHA_1Edge;                      // 第1个边沿采样
  SPI_InitStructure.SPI_NSS = SPI_NSS_Soft;                         // 片选信号由SSI寄存器控制
  SPI_InitStructure.SPI_BaudRatePrescaler = SPI_BAUDRATE_PCLK_DIVx; // 波特率为PCLK的分频
  SPI_InitStructure.SPI_FirstBit = SPI_FirstBit_MSB;                // 最高有效位 MSB 收发在前
  SPI_InitStructure.SPI_Speed = SPI_Speed_Low;                      // 低速SPI
	
	LCD_SCL_IO_Init();
	LCD_SDA_IO_Init();
	LCD_RES_IO_Init();
	LCD_DC_IO_Init();
	LCD_CS_IO_Init();LCD_CS_Set();
	LCD_BL_IO_Init();LCD_BL_On();
	
	__SYSCTRL_SPI1_CLK_ENABLE();
	SPI_Init(CW_SPI1, &SPI_InitStructure);
  SPI_Cmd(CW_SPI1, ENABLE);
	
	#if ((LCD_MODE == _FULL_BUFF_DYNA_UPDATE) || (LCD_MODE ==_PAGE_BUFF_DYNA_UPDATE))
		__SYSCTRL_CRC_CLK_ENABLE();//动态刷新CRC校验用
	#endif
	
	LCD_RES_Clr();
	{
		volatile unsigned int i=10000;
		while(i--);
	}
	LCD_RES_Set();

