JWXL19733/WeGui_RGB/CW32L012/Lcd_Port/cw32l012_lcd_hard_4spi_port.c
}

static void Set_SPI_DataSize_8b()
{
	//1.关闭SPI
	//SPI_Cmd(CW_SPI1, DISABLE);
	//CW_SPI1->CR2_f.EN = DISABLE;//寄存器操作
	
	//2.调整SPI参数
	//SPI_DataSizeConfig(CW_SPI1, SPI_DataSize_8b);
	REGBITS_MODIFY(CW_SPI1->CR1, SPIx_CR1_WIDTH_Msk, SPI_DataSize_8b);//寄存器操作
	
	//3.打开SPI
	//SPI_Cmd(CW_SPI1, ENABLE);
	//CW_SPI1->CR2_f.EN = ENABLE;//寄存器操作
}

static void Set_SPI_DataSize_16b()
{
	//1.关闭SPI
	//SPI_Cmd(CW_SPI1, DISABLE);
	//CW_SPI1->CR2_f.EN = DISABLE;//寄存器操作
	
	//2.调整SPI参数
	//SPI_DataSizeConfig(CW_SPI1, SPI_DataSize_16b);
	REGBITS_MODIFY(CW_SPI1->CR1, SPIx_CR1_WIDTH_Msk, SPI_DataSize_16b);//寄存器操作
	
	//3.打开SPI
	//SPI_Cmd(CW_SPI1, ENABLE);
	//CW_SPI1->CR2_f.EN = ENABLE;//寄存器操作
}

/*--------------------------------------------------------------
  * 名称: void LCD_Send_nCmd(uint16_t *p,uint16_t num)
  * 传入1: uint16_t *p:要发送的"1位命令+n个数据"的数组起始地址
  * 传入2: uint16_t num "命令+数据"的总数量(数组的长度)
  * 返回: 无
  * 功能: 向SPI发送指令
  * 说明: 阻塞运行
----------------------------------------------------------------*/


void LCD_Send_nCmd(uint8_t *p,uint16_t num)
{
	//数组[0]按照指令发送
	//余下位按照数据发送
		
		//3.设置SPI为8位模式
		Set_SPI_DataSize_8b();
			
		//4.开始传输第一个命令
		LCD_DC_Clr();
		LCD_CS_Clr();
		send_lcd_spi_dat(p[0]);//向SPI发送缓冲器发送一个数据

		//5.等待发送完成
		num--;
		wait_lcd_spi_txtemp_free();//等待SPI发送缓冲器为空
		send_lcd_spi_done();//等待SPI发送器空闲(发完)
	
		//6.发送剩下的数据
		LCD_DC_Set();
		while(num-->0)
		{
			p++;
			wait_lcd_spi_txtemp_free();//等待SPI发送缓冲器为空
			send_lcd_spi_dat(*p);//向SPI发送缓冲器发送一个数据
		}
		
		//7.等待发送完成
		wait_lcd_spi_txtemp_free();//等待SPI发送缓冲器为空
		send_lcd_spi_done();//等待SPI发送器空闲(发完)
		
		//8.结束
		LCD_CS_Set();	
}
#endif
/*--------------------------------------------------------------
  * 名称: LCD_Refresh(void)
  * 功能: 驱动接口,将显存LCD_GRAM全部内容发送至屏幕
----------------------------------------------------------------*/

//----------------------------普通OLED屏幕刷屏接口-------------------------------------
#if defined (LCD_USE_NORMAL_OLED)

//---------方式1:全屏刷新----------
#if (LCD_MODE == _FULL_BUFF_FULL_UPDATE)
RAM_SPEEDUP_FUNC_0 //代码加速宏定义
uint8_t LCD_Refresh(void)
{
	uint8_t ypage;
	for(ypage=0;ypage<GRAM_YPAGE_NUM;ypage++)
	{
		LCD_Set_Addr(0,ypage);
		LCD_Send_nDat(&lcd_driver.LCD_GRAM[ypage][0][0],SCREEN_WIDTH);
	}
	return 0;
}
//---------方式2:动态刷新----------
#elif (LCD_MODE == _FULL_BUFF_DYNA_UPDATE)
RAM_SPEEDUP_FUNC_0 //代码加速宏定义
uint8_t LCD_Refresh(void)
{
	//每page做"sum+mini_crc组合"校验,若校验码没变,则不刷新该page
	unsigned char ypage;
	uint16_t x;
	for(ypage=0;ypage<GRAM_YPAGE_NUM;ypage++)
	{
		uint32_t i_crc;
		//-----方式1:CRC算法校验-----
		lcd_crc();//宏定义
		//---------------------------

		if(crc[ypage][0] != i_crc)
		{
			LCD_Set_Addr(0,ypage);
			LCD_Send_nDat(&lcd_driver.LCD_GRAM[ypage][0][0],SCREEN_WIDTH);
			crc[ypage][0] = i_crc;
		}
	}
	return 0;
}

//---------方式3:页缓存全局刷新----------
#elif (LCD_MODE == _PAGE_BUFF_FULL_UPDATE)
uint8_t LCD_Refresh(void)
{
	uint8_t i=0;
	for(i=0;i<GRAM_YPAGE_NUM;i++)
	{
		LCD_Set_Addr(0,lcd_driver.lcd_refresh_ypage);
		LCD_Send_nDat(&lcd_driver.LCD_GRAM[i][0][0],SCREEN_WIDTH);
		lcd_driver.lcd_refresh_ypage++;
		if(lcd_driver.lcd_refresh_ypage >= ((SCREEN_HIGH+7)/8))
		{
			lcd_driver.lcd_refresh_ypage = 0;
			break;
		}
	}
	return lcd_driver.lcd_refresh_ypage;
}
//---------方式4:页缓存动态刷新----------
#elif (LCD_MODE == _PAGE_BUFF_DYNA_UPDATE)
RAM_SPEEDUP_FUNC_0 //代码加速宏定义
uint8_t LCD_Refresh(void)
{
	//每page做校验,若校验码没变,则不刷新该page
	uint8_t ypage;
	uint16_t x;
	for(ypage=0;ypage<GRAM_YPAGE_NUM;ypage++)
	{
		uint32_t i_crc;

		//判断屏幕是否已刷完
		if(lcd_driver.lcd_refresh_ypage + ypage > ((SCREEN_HIGH+7)/8)-1)
		{
			break;
		}
		
		//-----方式1:CRC算法校验-----
		lcd_crc();//宏定义
		//---------------------------

		if(crc[lcd_driver.lcd_refresh_ypage + ypage][0] != i_crc)
		{
			LCD_Set_Addr(0,lcd_driver.lcd_refresh_ypage + ypage);
			LCD_Send_nDat(&lcd_driver.LCD_GRAM[ypage][0][0],SCREEN_WIDTH);
			crc[lcd_driver.lcd_refresh_ypage + ypage][0] = i_crc;
		}
	}
	
	lcd_driver.lcd_refresh_ypage += GRAM_YPAGE_NUM;
	if(lcd_driver.lcd_refresh_ypage >= ((SCREEN_HIGH+7)/8))
	{
		lcd_driver.lcd_refresh_ypage = 0;
	}
	return lcd_driver.lcd_refresh_ypage;
}
#endif
//----------------------------灰度OLED屏幕刷屏接口-------------------------------------
#elif defined (LCD_USE_GRAY_OLED)//灰度OLED
#if (LCD_MODE == _FULL_BUFF_FULL_UPDATE)
//---------方式1:全缓存全屏刷新----------
RAM_SPEEDUP_FUNC_0 //代码加速宏定义
uint8_t LCD_Refresh(void)
{
	unsigned char x,y,i;
	#if defined(GRAY_DRIVER_0DEG)
	//---扫描方向1(不旋转)----
	LCD_Set_Addr(0,0,(SCREEN_WIDTH/2-1),(SCREEN_HIGH-1));
	LCD_DC_Set();
	LCD_CS_Clr();
	for(y=0;y<SCREEN_HIGH;y++)
	{
		uint8_t page,mask;
		page=y/8;
		mask=(0x01<<y%8);
		for(x=0;x<SCREEN_WIDTH;)
		{
			i = 0x00;
			//第一个点
			if(lcd_driver.LCD_GRAM[page][x][0]&mask)
			{
				i = GRAY_COLOUR<<4;
			}
			x++;
			//第二个点
			if(x<SCREEN_WIDTH)
			{
				if(lcd_driver.LCD_GRAM[page][x][0]&mask)
				{
					i |= GRAY_COLOUR;
				}
			}
			x++;
			wait_lcd_spi_txtemp_free();//等待SPI发送缓冲器为空
			send_lcd_spi_dat(i);//向SPI发送缓冲器发送一个数据
		}
	}

	#elif defined(GRAY_DRIVER_90DEG)
	//---扫描方向2(90度旋转)---
	LCD_Set_Addr(0,0,(SCREEN_HIGH/2-1),(SCREEN_WIDTH-1));
	LCD_DC_Set();
	LCD_CS_Clr();
	for(y=0;y<SCREEN_HIGH;y+=2)
	{
		uint8_t page1,page2,mask1,mask2;
		page1=y/8;
		page2=(y+1)/8;
		mask1=(0x01<<y%8);
		mask2=(0x01<<(y+1)%8);
		for(x=0;x<SCREEN_WIDTH;x++)
		{
			i = 0x00;
			//第一个点
			if(lcd_driver.LCD_GRAM[page1][x][0]&mask1)
			{
				i = GRAY_COLOUR<<4;
			}
			//第二个点
			if((y+1)<SCREEN_HIGH)
			{
				if(lcd_driver.LCD_GRAM[page2][x][0]&mask2)
				{
					i |= GRAY_COLOUR;
				}
			}
			wait_lcd_spi_txtemp_free();//等待SPI发送缓冲器为空
			send_lcd_spi_dat(i);//向SPI发送缓冲器发送一个数据
		}
	}
	#endif
	wait_lcd_spi_txtemp_free();//等待SPI发送缓冲器为空
	send_lcd_spi_done();//等待SPI发送器空闲(发完)
	LCD_CS_Set();
	return 0;
}

#elif (LCD_MODE == _FULL_BUFF_DYNA_UPDATE)
//---------方式2:全缓存动态刷新----------
RAM_SPEEDUP_FUNC_0 //代码加速宏定义
uint8_t LCD_Refresh(void)
{
	uint8_t ypage,y,i;
	uint16_t x,ycount;
	for(ypage=0;ypage<GRAM_YPAGE_NUM;ypage++)
	{
		uint32_t i_crc;
		
		//-----方式1:CRC算法校验-----
		lcd_crc();//宏定义
		//---------------------------

		if(crc[ypage][0] != i_crc)
		{
			ycount = 8* ypage;
#if defined(GRAY_DRIVER_0DEG)
			//----扫描方向1(不旋转)---
			LCD_Set_Addr(0,ycount,(SCREEN_WIDTH/2-1),(SCREEN_HIGH-1));
			LCD_DC_Set();
			LCD_CS_Clr();
			
			for(y=0;y<8;y++)
			{
				uint8_t mask;
				if(++ycount >= SCREEN_HIGH){break;}
				mask=0x01<<(y%8);
				for(x=0;x<SCREEN_WIDTH;)
				{
					//----第一个点----
					i = 0x00;
					if(lcd_driver.LCD_GRAM[ypage][x][0]&mask)
					{
						i = GRAY_COLOUR<<4;
					}
					//----第二个点----
					x++;
					if((lcd_driver.LCD_GRAM[ypage][x][0]&mask)&&(x<SCREEN_WIDTH))
					{
						i |= GRAY_COLOUR;
					}
					x++;
					wait_lcd_spi_txtemp_free();//等待SPI发送缓冲器为空
					send_lcd_spi_dat(i);//向SPI发送缓冲器发送一个数据
				}
			}

#elif defined(GRAY_DRIVER_90DEG)
			//---扫描方向2(90度旋转)----
			LCD_Set_Addr(ycount/2,0,(SCREEN_HIGH/2-1),(SCREEN_WIDTH-1));
			LCD_DC_Set();
			LCD_CS_Clr();
			for(y=0;y<8;y+=2)
			{
				if(++ycount >= SCREEN_HIGH){break;}
				for(x=0;x<SCREEN_WIDTH;x++)
				{
					//(4位一个点)
					//----第一个点----
					i = 0x00;
					if(lcd_driver.LCD_GRAM[ypage][x][0]&(0x01<<y))
					{
						i = GRAY_COLOUR<<4;
					}
					//----第二个点----
					if(lcd_driver.LCD_GRAM[ypage][x][0]&(0x01<<(y+1)))
					{
						i |= GRAY_COLOUR;
					}
					wait_lcd_spi_txtemp_free();//等待SPI发送缓冲器为空
					send_lcd_spi_dat(i);//向SPI发送缓冲器发送一个数据
				}
			}
#endif
			crc[ypage][0] = i_crc;
			wait_lcd_spi_txtemp_free();//等待SPI发送缓冲器为空
			send_lcd_spi_done();//等待SPI发送器空闲(发完)
			LCD_CS_Set();
		}
	}
	return 0;
}
//---------方式3:页缓存全局刷新----------
#elif (LCD_MODE == _PAGE_BUFF_FULL_UPDATE)
RAM_SPEEDUP_FUNC_0 //代码加速宏定义
uint8_t LCD_Refresh(void)
{
	uint8_t i;
	uint16_t x,y;
	#if defined(GRAY_DRIVER_0DEG)
	//---扫描方向1(不旋转)----
	LCD_Set_Addr(0,lcd_driver.lcd_refresh_ypage*8,(SCREEN_WIDTH/2-1),(SCREEN_HIGH-1));
	LCD_DC_Set();
	LCD_CS_Clr();
	for(y=0;(y+lcd_driver.lcd_refresh_ypage*8)<SCREEN_HIGH;)
	{
		uint8_t page,mask;
		page=y/8;
		mask=(0x01<<y%8);
		for(x=0;x<SCREEN_WIDTH;)
		{
			i = 0x00;
			//第一个点
			if(lcd_driver.LCD_GRAM[page][x][0]&mask)
			{
				i = GRAY_COLOUR<<4;
			}
			x++;
			//第二个点
			if(x<SCREEN_WIDTH)
			{
				if(lcd_driver.LCD_GRAM[page][x][0]&mask)
				{
					i |= GRAY_COLOUR;
				}
			}
			x++;
			wait_lcd_spi_txtemp_free();//等待SPI发送缓冲器为空
			send_lcd_spi_dat(i);//向SPI发送缓冲器发送一个数据
		}
		y++;
		if(y>=(GRAM_YPAGE_NUM*8))
		{
			break;
		}
	}

	#elif defined(GRAY_DRIVER_90DEG)
	//---扫描方向2(90度旋转)---
	LCD_Set_Addr(lcd_driver.lcd_refresh_ypage*4,0,(SCREEN_HIGH/2-1),(SCREEN_WIDTH-1));
	LCD_DC_Set();
	LCD_CS_Clr();
	for(y=0;(y+lcd_driver.lcd_refresh_ypage*8)<SCREEN_HIGH;)
	{
		uint8_t page1,page2,mask1,mask2;
		page1=y/8;
		page2=(y+1)/8;
		mask1=(0x01<<y%8);
		mask2=(0x01<<(y+1)%8);
		for(x=0;x<SCREEN_WIDTH;x++)
		{
			i = 0x00;
			//第一个点
			if(lcd_driver.LCD_GRAM[page1][x][0]&mask1)
			{
				i = GRAY_COLOUR<<4;
			}
			//第二个点
			if((y+1)<SCREEN_HIGH)
			{
				if(lcd_driver.LCD_GRAM[page2][x][0]&mask2)
				{
					i |= GRAY_COLOUR;
				}
			}
			wait_lcd_spi_txtemp_free();//等待SPI发送缓冲器为空
			send_lcd_spi_dat(i);//向SPI发送缓冲器发送一个数据
		}
		y+=2;
		if(y>=(GRAM_YPAGE_NUM*8))
		{
			break;
		}
	}
	#endif
	wait_lcd_spi_txtemp_free();//等待SPI发送缓冲器为空
	send_lcd_spi_done();//等待SPI发送器空闲(发完)
	LCD_CS_Set();
	
