JWXL19733/WeGui_RGB/CW32L012/Lcd_Port/cw32l012_lcd_hard_4spi_port.c
	lcd_driver.lcd_refresh_ypage += GRAM_YPAGE_NUM;
	if(lcd_driver.lcd_refresh_ypage >= ((SCREEN_HIGH+7)/8))
	{
		lcd_driver.lcd_refresh_ypage = 0;
	}
	return lcd_driver.lcd_refresh_ypage;
}


#elif (LCD_MODE == _PAGE_BUFF_DYNA_UPDATE)
//---------方式4:页缓存动态刷新----------
RAM_SPEEDUP_FUNC_0 //代码加速宏定义
uint8_t LCD_Refresh(void)
{
	uint8_t ypage;
	uint16_t x,ycount;
	for(ypage=0;ypage<GRAM_YPAGE_NUM;ypage++)
	{
		uint16_t i_crc;
		uint8_t i_dyna_count;//每页检测DYNA_CRC_NUM次
		if((lcd_driver.lcd_refresh_ypage + ypage)>=((SCREEN_HIGH+7)/8))
		{
			break;
		}
		for(i_dyna_count=0;i_dyna_count<PAGE_CRC_NUM;i_dyna_count++)
		{
			uint16_t x_start = i_dyna_count * DYNA_CRC_ONCE_XNUM;
			uint16_t x_end   = x_start + DYNA_CRC_ONCE_XNUM ;
			uint8_t *i = &lcd_driver.LCD_GRAM[ypage][x_start][0];
			if(x_end > (SCREEN_WIDTH-1)){x_end = SCREEN_WIDTH-1;}
			//--------CRC算法校验--------
			//--方式1.库函数--
			//i_crc = CRC16_Calc_8bit(CRC16_IBM, i, (x_end-x_start)*LCD_COLOUR_BIT);//从*i开始校验, 连续校验(x_end-x_start)*LCD_COLOUR_BIT次
			//--方式2.寄存器--
			CW_CRC->CR = CRC16_IBM;//清空CRC计算值
			for(x=0;x<=(x_end-x_start)*LCD_COLOUR_BIT;x++) //从*i开始校验, 连续校验(x_end-x_start)*LCD_COLOUR_BIT次
			{
				CW_CRC->DR = *i++;
			}
			i_crc = CW_CRC->RESULT;//把校验值, 赋给i_crc
			//---------------------------
			
			if(crc[lcd_driver.lcd_refresh_ypage + ypage][i_dyna_count] != i_crc)
			{
				uint8_t y=0;
				
				LCD_Set_Addr(x_start,(lcd_driver.lcd_refresh_ypage+ypage)*8,x_end,SCREEN_HIGH-1);
				LCD_DC_Set();
				LCD_CS_Clr();
				Set_SPI_DataSize_16b();
				
				ycount = 8* (ypage + lcd_driver.lcd_refresh_ypage);
				for(y=0;y<8;y++)
				{
					uint8_t mask;
					if(++ycount > SCREEN_HIGH)
					{
						break;
					}
					mask=0x01<<(y%8);
					uint8_t *gram=&lcd_driver.LCD_GRAM[ypage][x_start][0];
					for(x=0;x<=(x_end-x_start);x++)
					{
						uint8_t c=0;
						#if (LCD_COLOUR_BIT>=1)//---1位色---
							if(*gram++&mask){c+=1;}
						#endif
						#if (LCD_COLOUR_BIT>=2)//---2位色---
							if(*gram++&mask){c+=2;}
						#endif
						#if (LCD_COLOUR_BIT>=3)//---3位色---
							if(*gram++&mask){c+=4;}
						#endif
						wait_lcd_spi_txtemp_free();//等待SPI发送缓冲器为空
						send_lcd_spi_dat(lcd_driver.colour[c]);//向SPI发送缓冲器发送一个数据
					}
				}
				crc[lcd_driver.lcd_refresh_ypage + ypage][i_dyna_count] = i_crc;
				wait_lcd_spi_txtemp_free();//等待SPI发送缓冲器为空 (某些芯片可以省略掉这一句)
				send_lcd_spi_done();//等待SPI发送器空闲(发完)
				LCD_CS_Set();
				Set_SPI_DataSize_8b();
			}
		}
	}
	Set_SPI_DataSize_8b();
	
	lcd_driver.lcd_refresh_ypage += GRAM_YPAGE_NUM;
	if(lcd_driver.lcd_refresh_ypage >= ((SCREEN_HIGH+7)/8))
	{
		lcd_driver.lcd_refresh_ypage = 0;
	}
	return lcd_driver.lcd_refresh_ypage;
}
#endif



#endif
#endif
